app/controllers/restaurants_controller.rb

INSERT INTO "restaurants" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Varya"], ["created_at", 2017-02-20 17:41:50 UTC], ["updated_at", 2017-02-20 17:41:50 UTC]]
---
  def create
    @restaurant = Restaurant.create(restaurant_params)